Repository: mvonderheide/YouRock-2
Catalog: YouRock2/*.lproj/Localizable.strings
Languages: es

source: Welcome, Mr. Vonderheide!
es: ¡Bienvenidos, Sr. Vonderheide!

source: 1st Period
es: Primer periodo

source: 2nd Period
es: Segundo período

source: 3rd Period
es: Tercer período

source: 4th Period
es: Cuarto período

source: Recognize a Student
es: Dar reconocimiento a un estudiante

source: View Student Data
es: Ver datos de los estudiantes

source: Get Started, Mr. Vonderheide
es: ¡Empecemos, Sr. Vonderheide!

source: Teacher Mode
es: Vista del profesor

source: Choose a Student
es: Elige un estudiante

source: Choose a Category
es: Elige una categoría

source: Relationship Skills
es: Habilidades de relación

source: Responsible Decision-Making
es: Toma de decisiones responsable

source: Self-Awareness
es: Conciencia de sí mismo

source: Self-Management
es: Autogestión

source: Social Awareness
es: Conciencia social

source: Choose a Subcategory
es: Elige una subcategoría

source: you managed your own emotions
es: manejaste tus propias emociones

source: you used self-management strategies
es: usaste estrategias de autogestión

source: you exhibited self-discipline and perseverance
es: exhibiste autodisciplina y perseverancia

source: you set personal and collective goals
es: te pones metas personales y colectivas

source: you used planning and organizational skills
es: usaste habilidades de planificación y organización

source: you showed the courage to take initiative
es: mostraste el coraje para tomar la iniciativa

source: First Name
es: Primer nombre

source: Last Name
es: Apellido

source: # of Rocks
es: # de rocas

source: 1st Period Rocks!
es: ¡1er período Rocks!

source: Choose a Classmate
es: Elige un compañero de clase

source: Miguel, you rock because you exhibited self-discipline and perseverance!
es: Miguel, You Rock porque exhibiste autodisciplina y perseverancia

source: Recognize another student
es: Dar reconocimiento a otro/a estudiante
